app/controllers/dictionary_controller.rb

SELECT "dictionaries".* FROM "dictionaries" ORDER BY "dictionaries"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def top
    @dictionary = Dictionary.last

INSERT INTO "dictionaries" ("content", "translation", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "りんご"], ["translation", nil], ["created_at", "2022-06-22 03:18:34.262053"], ["updated_at", "2022-06-22 03:18:34.262053"]]
---
  def create
    @dictionary = Dictionary.new(content: params[:content])
    @dictionary.save