app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def show
    @post = Post.find_by(id: params[:id])
    @user = User.find_by(id: @post.user_id)

INSERT INTO "posts" ("content", "created_at", "updated_at", "comment", "translation", "user_id", "title", "start_time") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(
      content: params[:content],
      user_id: @current_user.id,
      title: params[:title],
      start_time: params[:start_time]
                     )
    # @post[:start_time] = Date.today.strftime('%Y-%m-%d')
    @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = ?, "translation" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-06-17 06:23:50.289916"], ["translation", "翻訳"], ["id", 8]]
---
  def create_comment
    @post = Post.find_by(id: params[:id])
    @post.comment = params[:comment]
    @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def edit
    @post = Post.find_by(id: params[:id])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "posts" SET "updated_at" = ?, "translation" = ? WHERE "posts"."id" = ?  [["updated_at", "2022-06-22 00:14:52.621112"], ["translation", "りんご"], ["id", 29]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destory
    @post = Post.find_by(id: params[:id])
    @post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "translation" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["translation", nil], ["updated_at", "2022-06-17 08:36:08.765506"], ["id", 16]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 30], ["LIMIT", 1]]
---
  def translation
      @post = Post.find_by(id: params[:id])
      @post.translation = @post.content
      @post.save

      options = Selenium::WebDriver::Chrome::Options.new
      options.add_argument('--headless')
      @driver = Selenium::WebDriver.for :chrome, options: options
      @driver.manage.window.resize_to(1200, 1000)
      @driver.get("https://translate.weblio.jp/")
      @driver.find_element(:xpath, '//*[@id="originalTextArea"]').click
      sleep 0.5
      @driver.find_element(:xpath, '//*[@id="originalTextArea"]').send_keys(@post.translation)