app/controllers/users_controller.rb

  def edit
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      image_name: "neko.jpg",
      password: params[:password]
    )
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password_digest") VALUES (?, ?, ?, ?, ?, ?)  [["name", "q"], ["email", "q"], ["created_at", "2022-06-21 23:52:40.843765"], ["updated_at", "2022-06-21 23:52:40.843765"], ["image_name", "neko.jpg"], ["password_digest", "[FILTERED]"]]

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    @user.password = params[:password]
    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end
    @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "image_name" = ? WHERE "users"."id" = ?  [["updated_at", "2022-06-20 03:50:41.817700"], ["image_name", "2.jpg"], ["id", 2]]

  def destroy
    @user = User.find_by(id: params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def login
    @user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "z"], ["LIMIT", 1]]