app/models/post.rb

    def user
        return User.find_by(id: self.user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]